app/views/ideas/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
      <div class="col-md-3">
        <strong><%= comment.user.email if comment.user.present? %></strong>