app/controllers/ideas_controller.rb

  def index
    @ideas = Idea.all
---
SELECT "ideas".* FROM "ideas"

  def show
    @comments = @idea.comments.all
---
SELECT "comments".* FROM "comments" WHERE "comments"."idea_id" = ?  [["idea_id", 3]]

  def create
    @idea = Idea.new(idea_params)

    respond_to do |format|
      if @idea.save
---
INSERT INTO "ideas" ("name", "description", "picture", "birthday", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Nguyen Nhu Y"], ["description", "abcde"], ["picture", "nguyennnn"], ["birthday", "1/1/1000"], ["created_at", "2017-09-16 07:31:03.584094"], ["updated_at", "2017-09-16 07:31:03.584094"]]

  def update
    respond_to do |format|
      if @idea.update(idea_params)
---
UPDATE "ideas" SET "picture" = ?, "user_id" = ?, "updated_at" = ? WHERE "ideas"."id" = ?  [["picture", "tj8ov7024ytzsv68deci.jpg"], ["user_id", 2], ["updated_at", "2017-09-17 08:17:59.654828"], ["id", 14]]

  def destroy
    @idea.destroy
---
DELETE FROM "ideas" WHERE "ideas"."id" = ?  [["id", 1]]

    def set_idea
      @idea = Idea.find(params[:id])
---
SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]